In [16]:
import pandas as pd
import numpy as np

### Series

In [3]:
x = pd.Series()
print(x)

Series([], dtype: float64)

C:\Users\ASUS\AppData\Local\Temp\ipykernel_11992\1162745515.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  x = pd.Series()

In [5]:
# series ex
sr1 = pd.Series([1, 2, 5, 7, 8])
sr1

0    1
1    2
2    5
3    7
4    8
dtype: int64

In [6]:
# re-indexing the default index columns
sr2 = pd.Series([1, 2, 5, 7, 8], index=['a', 'b', 'c', 'd', 'e'])
sr2

a    1
b    2
c    5
d    7
e    8
dtype: int64

In [7]:
### accessing a Series element
sr2['b']

2

In [17]:
# data manipulation with series
print('adding 5 to a Series:\n', sr2 + 5)

print('filterinh series with greater than 5: \n', sr2[sr2>5])
print('square root of Series elemnets: \n', np.sqrt(sr2))

adding 5 to a Series:
 a     6
b     7
c    10
d    12
e    13
dtype: int64
filterinh series with greater than 5:
 d    7
e    8
dtype: int64
square root of Series elemnets:
 a    1.000000
b    1.414214
c    2.236068
d    2.645751
e    2.828427
dtype: float64

In [19]:
# a sample dic
dt = {'abc':1, 'def':2, 'ghi':3}
print(dt)

pd.Series(dt)

{'abc': 1, 'def': 2, 'ghi': 3}

abc    1
def    2
ghi    3
dtype: int64

### Data Frame

In [20]:
# ceating an empty datdframe
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [23]:
### a sample list containing name and age

data = [['Tom', 10], ['Harry', 12], ['Jim', 13]]
df = pd.DataFrame(data, columns=['Name', 'Age'])
df

    Name  Age
0    Tom   10
1  Harry   12
2    Jim   13

In [24]:
### accessing a df column
df['Name']

0      Tom
1    Harry
2      Jim
Name: Name, dtype: object

In [25]:
df.Name

0      Tom
1    Harry
2      Jim
Name: Name, dtype: object

In [26]:
## adding a column in existing dataframe
df['Year'] = 2008
df

    Name  Age  Year
0    Tom   10  2008
1  Harry   12  2008
2    Jim   13  2008

In [31]:
print('original df: \n', df)
# del df['Year']
print('df after del: \n', df)
df.pop('Age')
print('df after pop: \n', df)

original df:
     Name  Age
0    Tom   10
1  Harry   12
2    Jim   13
df after del:
     Name  Age
0    Tom   10
1  Harry   12
2    Jim   13
df after pop:
     Name
0    Tom
1  Harry
2    Jim

In [33]:
### loc[] and iloc[]

# a sample containing company stock data
data = pd.DataFrame({'price':[95, 25, 85, 41],
                    'ticker':['AXP', 'CSCO', 'DIS', "MSFT"],
                    'company':['American Express', 'Cisco',
                              'Walt Disney', 'Micosoft']})
data

   price ticker           company
0     95    AXP  American Express
1     25   CSCO             Cisco
2     85    DIS       Walt Disney
3     41   MSFT          Micosoft

In [34]:
# accessing the value that is at index 0, in column 'company' using loc
print(data.loc[0]['company'])
# accessing the value that is at index 0, in column 'company' using iloc
print(data.loc[0][0])

American Express
95

### Some Useful DataFrame Functions

In [36]:
# inspeting top 5 rows of a df
print('top fivev data: \n', data.head())

# inspecting below 5 rows of a  df
print('below 5 data:\n', data.tail())

top fivev data:
    price ticker           company
0     95    AXP  American Express
1     25   CSCO             Cisco
2     85    DIS       Walt Disney
3     41   MSFT          Micosoft
below 5 data:
    price ticker           company
0     95    AXP  American Express
1     25   CSCO             Cisco
2     85    DIS       Walt Disney
3     41   MSFT          Micosoft

In [37]:
# check data type of columns
data.dtypes

price       int64
ticker     object
company    object
dtype: object

In [38]:
# describe statistics of the data
data.describe()

           price
count   4.000000
mean   61.500000
std    33.798422
min    25.000000
25%    37.000000
50%    63.000000
75%    87.500000
max    95.000000

In [39]:
# information of the dataframe
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   price    4 non-null      int64
 1   ticker   4 non-null      object
 2   company  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

### Handling missing values in DataFrame

In [42]:
# a sample df
df = pd.DataFrame(np.random.randn(5, 3),
                 index=['a', 'c', 'e', 'f', 'h'],
                 columns = ['one', 'two', 'three'])
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df2

        one       two     three
a -1.489347 -0.379306  1.518648
b       NaN       NaN       NaN
c -0.528422  0.217663 -1.156578
d       NaN       NaN       NaN
e  0.767677  0.112412 -2.139931
f -0.439415 -0.069214  0.356243
g       NaN       NaN       NaN
h  0.108500  0.370346  1.028085

In [44]:
### checking missing values using null()

print(df2.isnull())
miss_val = df2.isnull().sum()
print("count of missing values: \n", miss_val)

     one    two  three
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True   True
e  False  False  False
f  False  False  False
g   True   True   True
h  False  False  False
count of missing values:
 one      3
two      3
three    3
dtype: int64

In [46]:
# remove all the rows that contain a missing value
df = df2.dropna()
print(df)

        one       two     three
a -1.489347 -0.379306  1.518648
c -0.528422  0.217663 -1.156578
e  0.767677  0.112412 -2.139931
f -0.439415 -0.069214  0.356243
h  0.108500  0.370346  1.028085

In [47]:
# remove all columns with at least one missing value
column_with_nadrop = df2.dropna(axis=1)
column_with_nadrop.head()

Empty DataFrame
Columns: []
Index: [a, b, c, d, e]

In [48]:
# filling NaN with zeros
df3 = df2.fillna(0)
df3

        one       two     three
a -1.489347 -0.379306  1.518648
b  0.000000  0.000000  0.000000
c -0.528422  0.217663 -1.156578
d  0.000000  0.000000  0.000000
e  0.767677  0.112412 -2.139931
f -0.439415 -0.069214  0.356243
g  0.000000  0.000000  0.000000
h  0.108500  0.370346  1.028085

In [50]:
# replace all NA's the value that comes directly after it in the same column
# then replace all the remaining na's with 0
df4 = df2.fillna(method='bfill', axis=0).fillna(0)
df4

        one       two     three
a -1.489347 -0.379306  1.518648
b -0.528422  0.217663 -1.156578
c -0.528422  0.217663 -1.156578
d  0.767677  0.112412 -2.139931
e  0.767677  0.112412 -2.139931
f -0.439415 -0.069214  0.356243
g  0.108500  0.370346  1.028085
h  0.108500  0.370346  1.028085